#include "Header.h" // Подключение заголовочного файла

//  точка входа в программу функция main 
int main() {
	setlocale(LC_ALL, "RUS"); // Русифицирование вывода в консоль
	
	// Номер 1
	int N = 3, x;						   // Иницилизация количества элементов последовательности, и элемента последовательности
	int count = 0;						  // Количество  числел, квадрат которых оканчивается на 6 и состоит не менее чем из 3 цифр
	int max_sum_f_l = 0;				 // Максимальная сумма крайних цифр у числа
	cout << "Введите числа:" << endl;
	for (int i = 0; i < N; ++i) {		// Цикл ввода и обработки элементов
		cin >> x;
		count += count_square63(x); 
		max_sum_f_l = sun_extreme(x, max_sum_f_l); 
	}

	cout << "Максимальная сумма крайних цифр у числа:" << max_sum_f_l << endl;
	cout << "Количество  числел, квадрат которых оканчивается на 6 и состоит не менее чем из 3 цифр:" << count << endl;
	unsigned int n = -5;
	cout << n;

	cout << "==========================================================================================" << endl;

	cout << decomposition(1) << endl;
	cout << decomposition(0.1) << endl;
	cout << decomposition(2) << endl;

	cout << "==========================================================================================" << endl;
	
	// Номер 3
	int digit;
	cout << "Число для возведения в квадрат:";
	cin >> digit;
	int res = square(digit);
	cout << "Квадрат " << digit << " = " << res << endl;

	cout << "=======================================Test===============================================" << endl;

	int a[] = { 0, 123, 34, 44, -5 };
	for (int i = 0; i < 5; ++i) {
		cout << "Длина:" << a[i] << " = " << LEN(a[i]) << " | " << "count_square63:" << count_square63(a[i]) << " | Максимальная cумма крайних:" << sun_extreme(a[i], 5) << endl;
		cout << "Квадрат " << a[i] << " = " << square(a[i]) << endl;
	}
}

